app/views/books/_book_list.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                <%= link_to book_favorites_path(book), method: :delete do %>
                  ♥<%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                <%= link_to book_favorites_path(book), method: :post do %>
                  ♡<%= book.favorites.count %>

SELECT books.*, count(favorites.id) AS favs FROM "books" LEFT OUTER JOIN "favorites" ON "favorites"."book_id" = "books"."id" WHERE "books"."created_at" >= ? AND "books"."created_at" < ? GROUP BY books.id ORDER BY favs DESC  [["created_at", "2021-08-08 00:00:00"], ["created_at", "2021-08-14 23:59:59.999999"]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
          </td>
          <td>コメント数: <%= book.book_comments.count %></td>