app/controllers/books_controller.rb

SELECT "books".* FROM "books"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."book_id" IN (?, ?, ?, ?, ?, ?, ?, ?)  [["book_id", 1], ["book_id", 2], ["book_id", 3], ["book_id", 4], ["book_id", 5], ["book_id", 6], ["book_id", 7], ["book_id", 8]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" >= ? AND "users"."created_at" < ?  [["book_id", 2], ["created_at", "2021-08-02 00:00:00"], ["created_at", "2021-08-08 23:59:59.999999"]]
SELECT COUNT(*) FROM "users" INNER JOIN "favorites" ON "users"."id" = "favorites"."user_id" WHERE "favorites"."book_id" = ? AND "users"."created_at" >= ? AND "users"."created_at" < ?  [["book_id", 1], ["created_at", "2021-08-02 00:00:00"], ["created_at", "2021-08-08 23:59:59.999999"]]
---
  def index
    @user = current_user
    # @books = book.select("books.*", "count(favorites.id) AS favs").left_joins(:favorites).group("books.id").order("favs DESC")
    to  = Time.current.at_end_of_day
    from  = (to - 6.day).at_beginning_of_day
    @books = Book.includes(:favorited_users).
      sort {|a,b|
        b.favorited_users.includes(:favorites).where(created_at: from...to).size <=>
        a.favorited_users.includes(:favorites).where(created_at: from...to).size

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def show
    @books = Book.find(params[:id])

UPDATE "books" SET "impressions_count" = COALESCE("impressions_count", 0) + 1 WHERE "books"."id" = ?  [["id", 7]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)