app/controllers/book_comments_controller.rb

  def create
    book = Book.find(params[:book_id])
    comment = current_user.book_comments.new(book_comment_params)
    comment.book_id = book.id
    comment.save
    @books = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "a"], ["user_id", 1], ["book_id", 2], ["created_at", "2021-08-05 11:10:40.361952"], ["updated_at", "2021-08-05 11:10:40.361952"]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    BookComment.find_by(id: params[:id], book_id: params[:book_id]).destroy
    @books = Book.find(params[:book_id])
---
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 3]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? AND "book_comments"."book_id" = ? LIMIT ?  [["id", 3], ["book_id", 2], ["LIMIT", 1]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]